In [10]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Age': [24, 27, 22, 32, 29, 23],
    'City': ['New York', 'Los Angeles', 'New York', 'Houston', 'San Francisco', 'New York'],
    'Salary': [70000, 80000, 65000, 90000, 75000, 60000]
}

df = pd.DataFrame(data)

In [11]:
print(df)

      Name  Age           City  Salary
0    Alice   24       New York   70000
1      Bob   27    Los Angeles   80000
2  Charlie   22       New York   65000
3    David   32        Houston   90000
4      Eva   29  San Francisco   75000
5    Frank   23       New York   60000

In [ ]:
# Select the 'Name' and 'Salary' columns
names = df.Name
salaries = df.Salary
print(names)
print(salaries)

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
Name: Name, dtype: object
0    70000
1    80000
2    65000
3    90000
4    75000
5    60000
Name: Salary, dtype: int64

In [ ]:
# Select the first three rows of the DataFrame
rows_1_to_3 = df.iloc[:3]
print(rows_1_to_3)

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22     New York   65000

In [19]:
# Print rows where age > 25
over_25 = df.loc[df['Age'] > 25]
print(over_25)

    Name  Age           City  Salary
1    Bob   27    Los Angeles   80000
3  David   32        Houston   90000
4    Eva   29  San Francisco   75000

In [20]:
# Add bonus column which is 10% of salary
df['Bonus'] = df['Salary'] * 0.10
print(df)

      Name  Age           City  Salary   Bonus
0    Alice   24       New York   70000  7000.0
1      Bob   27    Los Angeles   80000  8000.0
2  Charlie   22       New York   65000  6500.0
3    David   32        Houston   90000  9000.0
4      Eva   29  San Francisco   75000  7500.0
5    Frank   23       New York   60000  6000.0

In [22]:
# Change the City of Bob to SF
df.loc[df['Name'] == 'Bob', 'City'] = 'San Francisco'
print(df)

      Name  Age           City  Salary   Bonus
0    Alice   24       New York   70000  7000.0
1      Bob   27  San Francisco   80000  8000.0
2  Charlie   22       New York   65000  6500.0
3    David   32        Houston   90000  9000.0
4      Eva   29  San Francisco   75000  7500.0
5    Frank   23       New York   60000  6000.0

In [ ]:
# Delete the 'Bonus' column
del df['Bonus']
print(df)

      Name  Age           City  Salary
0    Alice   24       New York   70000
1      Bob   27  San Francisco   80000
2  Charlie   22       New York   65000
3    David   32        Houston   90000
4      Eva   29  San Francisco   75000
5    Frank   23       New York   60000

In [24]:
# Group the DataFrame by ‘City’ and calculate the average ‘Salary’ for each
df_grouped = df.groupby('City')['Salary'].mean().reset_index()
print(df_grouped)

            City   Salary
0        Houston  90000.0
1       New York  65000.0
2  San Francisco  77500.0